The argument name is inherited from the [AWS API data type](https://docs.aws.amazon.com/AmazonCloudWatchLogs/latest/APIReference/API_LogGroup.html) so it probably won't be corrected for backward compatibility reasons. However the description is correct in that the `kms_key_id` argument indeed refers to the KMS key ARN (e.g. `aws_kms_key.my_key.arn`), not the key ID (e.g. `aws_kms_key.my_key.key_id`). Passing in the latter will result in a failure.

```ps
Terraform will perform the following actions:

  # aws_cloudwatch_log_group.my_log_group will be created
  + resource "aws_cloudwatch_log_group" "my_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "0be1d7a7-7c48-4204-862a-9009fd737230"
      + log_group_class   = (known after apply)
      + name              = "my-log-group"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_cloudwatch_log_group.my_log_group: Creating...
╷
│ Error: creating CloudWatch Logs Log Group (my-log-group): operation error CloudWatch Logs: CreateLogGroup, https response error StatusCode: 400, RequestID: c6775bbe-a17b-4f14-bb69-a607cff914b2, InvalidParameterException: The specified KMS Key Id could not be found.
│
│   with aws_cloudwatch_log_group.my_log_group,
│   on main.tf line 29, in resource "aws_cloudwatch_log_group" "my_log_group":
│   29: resource "aws_cloudwatch_log_group" "my_log_group" {
│
```